### Hiring
A machine learning model for HR department, helping them decide salaries for future candidates.

In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [54]:
salary = pd.read_csv("hiring.csv")
salary

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [55]:
salary2 = salary.copy()

In [56]:
salary2.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [57]:
salary2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [58]:
import math

In [59]:
mean_tscore = math.floor(salary2["test_score(out of 10)"].mean())
salary2["test_score(out of 10)"] = salary2["test_score(out of 10)"].fillna(mean_tscore)

In [60]:
salary2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [61]:
salary2.experience = salary2.experience.fillna("zero") 
salary2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [66]:
import sys
!{sys.executable} -m pip install word2number

Processing c:\users\cindi\appdata\local\pip\cache\wheels\4b\c3\77\a5f48aeb0d3efb7cd5ad61cbd3da30bbf9ffc9662b07c9f879\word2number-1.1-py3-none-any.whl
Installing collected packages: word2number
Successfully installed word2number-1.1

In [71]:
from word2number import w2n
salary2.experience = salary2.experience.apply(w2n.word_to_num)

In [72]:
salary2

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [81]:
from sklearn import linear_model
model = linear_model.LinearRegression()
model.fit(salary2[["experience", "test_score(out of 10)", "interview_score(out of 10)"]],salary2["salary($)"])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [83]:
model.predict([[4, 8, 6]])

array([57337.09570169])

In [86]:
model.predict([[13, 9, 7]])

array([88006.30850284])